{"v":1,"model":"sentence-transformers/all-MiniLM-L6-v2 -> PCA-40 -> uint8","dims":72,"mins":[-0.360057,-0.411914,-0.346653,-0.293064,-0.510692,-0.30701,-0.351873,-0.321594,-0.44056,-0.359848,-0.36283,-0.253831,-0.300354,-0.311096,-0.259515,-0.26741,-0.250298,-0.260289,-0.230441,-0.211291,-0.256941,-0.237856,-0.248639,-0.225029,-0.345489,-0.254216,-0.204121,-0.202119,-0.277682,-0.22478,-0.265634,-0.336077,-0.301034,-0.209353,-0.214139,-0.226564,-0.215617,-0.242332,-0.261353,-0.250797,-0.216125,-0.243204,-0.23007,-0.190602,-0.189008,-0.242167,-0.244468,-0.212519,-0.199053,-0.213612,-0.189993,-0.196938,-0.215837,-0.16647,-0.190009,-0.194067,-0.164291,-0.198013,-0.181005,-0.194186,-0.179456,-0.166192,-0.157646,-0.216119,-0.130882,-0.212574,-0.151733,-0.153582,-0.151721,-0.181015,-0.182199,-0.148459],"scale":[0.77195,0.713772,0.757285,0.710315,0.789759,0.638983,0.668743,0.711491,0.725513,0.735691,0.652492,0.561399,0.594186,0.588876,0.530746,0.538749,0.515967,0.556721,0.478795,0.537137,0.506228,0.533631,0.493317,0.479061,0.62527,0.478889,0.401916,0.429615,0.478202,0.447219,0.473013,0.560274,0.507494,0.418201,0.456599,0.45385,0.44127,0.422995,0.541084,0.478198,0.45603,0.459352,0.483611,0.4729,0.396535,0.463982,0.49111,0.415615,0.39832,0.426149,0.381102,0.382998,0.418254,0.385861,0.436817,0.374661,0.320456,0.407741,0.393808,0.404935,0.35716,0.367588,0.358598,0.402068,0.335221,0.376592,0.313639,0.311942,0.35435,0.362163,0.373499,0.335636],"words":["afraid","afternoon","air","airplane","angry","ant","anxious","apple","art","artist","autumn","baby","bake","ball","banana","barn","beach","bear","beauty","bed","bedroom","bee","bicycle","bird","birthday","bitter","black","blue","boat","book","bored","branch","brave","bread","bridge","bright","brother","brown","build","burger","bus","butter","butterfly","cafe","cake","calm","camera","canyon","car","castle","cat","cave","chair","challenge","cheese","chef","cherry","chicken","child","chocolate","church","city","clean","cliff","climb","clock","cloud","coffee","competition","computer","confident","confused","content","cook","cookie","courage","cow","crawl","create","crop","crown","cry","curious","dance","dark","daughter","deer","defeat","desert","diamond","discover","doctor","dog","dolphin","door","dragon","drawing","dream","drink","drought","duck","dull","eagle","earth","earthquake","eat","egg","elder","elephant","empire","energetic","engineer","evening","excited","explore","family","farm","farmer","fast","father","fear","fence","field","fierce","fire","fish","flood","floor","flower","fly","fog","forest","forget","fox","freedom","fresh","friend","frog","frustrated","game","garden","gate","gentle","gift","giraffe","glacier","goat","gold","goose","grape","grass","grateful","gray","green","happy","hard","harvest","hate","hawk","heavy","hero","hill","holiday","home","honesty","honey","hope","hopeful","horse","hospital","hour","house","hurricane","ice","invent","island","jealous","jewel","joy","jump","jungle","justice","kangaroo","kindness","king","kingdom","kitchen","knight","lake","lamp","laugh","leaf","learn","lemon","library","light","lightning","lion","listen","lonely","loud","love","loyalty","magic","mango","market","medal","milk","minute","mirror","money","monkey","month","moon","morning","mother","mountain","mouse","movie","museum","music","musician","necklace","neighbor","nervous","night","novel","nurse","ocean","orange","owl","painting","paper","park","pasta","patience","peace","peaceful","peach","pear","pearl","pen","pencil","penguin","pepper","phone","pig","pilot","pineapple","pink","pizza","plateau","play","poem","potion","power","present","prize","proud","purple","queen","quiet","rabbit","race","radio","rain","read","red","relaxed","remember","respect","rest","restaurant","reward","rice","ring","river","road","roof","room","root","rough","run","sad","sailor","salad","salt","salty","sandwich","school","scientist","sculpture","sea","season","second","shark","sharp","sheep","shelf","shield","ship","shop","shy","silver","sing","sister","sky","sleep","slow","smooth","snake","snow","sofa","soft","soldier","son","song","soup","sour","sparrow","speak","spell","spicy","spider","sport","spring","stairs","stale","star","store","storm","story","strawberry","street","strength","strong","student","sugar","summer","sun","surprised","swan","sweet","swim","sword","table","tea","teach","teacher","team","television","temple","think","throne","thunder","tiger","tired","today","tomorrow","tornado","tower","town","tractor","train","travel","treasure","tree","trophy","truck","trust","truth","tunnel","turtle","university","valley","victory","village","villain","volcano","wake","walk","wall","war","warrior","wash","watch","water","waterfall","watermelon","weak","weakness","week","whale","white","wind","window","winter","wisdom","witch","wizard","wolf","work","write","writer","yard","year","yellow","yesterday","zebra","zoo"],"vectors":[[217,166,94,93,187,93,157,67,197,122,159,94,86,147,116,105,132,75,155,79,133,106,186,190,47,79,122,180,189,84,88,195,172,176,143,114,41,141,162,155,134,86,120,60,150,87,138,185,114,138,79,255,164,79,154,108,124,107,177,81,159,163,59,163,119,126,177,197,151,114,53,112],[99,204,140,198,215,152,9,207,151,134,87,135,188,203,203,116,67,105,88,149,183,118,155,120,142,91,142,125,150,65,138,181,135,103,141,166,136,159,146,170,171,113,215,126,118,178,121,145,176,73,118,87,198,143,91,120,213,113,64,98,125,192,122,120,84,149,135,116,130,149,94,125],[109,128,115,143,176,251,115,66,160,119,155,136,118,66,59,117,131,137,37,58,126,105,106,150,163,161,155,98,185,164,100,159,208,135,46,102,169,152,176,174,67,151,158,63,63,151,81,49,209,91,2,64,180,95,78,136,176,79,81,52,88,170,118,187,112,128,120,166,124,152,139,50],[67,143,86,55,182,228,115,81,142,161,161,181,169,63,74,101,84,96,72,79,82,73,10,161,125,156,65,108,138,58,35,239,191,180,80,92,114,103,116,111,164,167,75,133,54,133,119,9,84,43,103,138,132,69,110,131,108,107,129,127,155,122,153,157,93,103,78,182,133,163,119,111],[211,145,100,116,181,124,147,79,174,137,114,103,101,121,42,117,163,101,122,60,142,119,92,174,97,61,131,102,169,121,214,169,170,84,146,143,81,240,123,165,210,152,166,186,104,73,148,133,142,107,150,116,134,189,140,164,97,47,129,149,137,123,143,121,104,200,80,67,124,139,96,112],[106,99,43,58,174,115,135,117,118,148,136,186,41,180,121,74,80,121,52,122,68,194,161,166,133,146,178,101,127,146,163,216,171,140,133,124,104,133,140,149,128,107,119,217,84,133,124,93,115,179,214,120,213,88,24,205,156,164,92,61,58,130,114,164,159,105,133,184,238,148,138,96],[206,131,106,124,183,182,114,1,168,135,89,121,115,160,136,37,113,80,134,54,95,54,180,203,91,20,103,105,153,102,159,223,212,169,192,163,116,167,164,160,105,180,138,67,150,177,127,146,145,148,126,223,142,97,102,137,147,70,146,138,102,132,103,106,168,137,152,116,103,88,109,120],[88,108,150,77,136,123,120,119,121,156,180,132,103,127,47,118,102,200,41,157,234,124,122,129,155,77,100,137,200,75,91,110,150,176,144,162,27,123,114,184,161,151,121,95,195,0,97,123,179,179,153,16,88,42,131,144,76,131,128,101,116,122,189,182,101,108,34,90,105,120,45,158],[138,185,121,43,82,202,167,135,118,178,86,39,90,197,142,129,143,114,184,66,122,149,105,104,142,163,202,143,201,129,113,120,190,37,57,33,138,93,203,162,126,148,178,111,84,107,153,132,212,159,160,171,183,122,118,60,87,46,68,154,89,104,151,129,101,185,101,127,174,109,138,145],[130,158,115,65,102,155,131,150,97,199,43,96,99,172,122,107,177,78,225,93,96,122,121,40,154,112,168,150,240,82,103,74,206,95,147,62,77,130,153,139,85,93,183,142,74,143,164,95,174,203,198,152,164,142,128,83,95,56,134,130,129,90,131,217,111,191,43,145,122,116,165,181],[72,181,89,240,156,166,132,189,127,103,75,133,77,135,110,112,160,89,79,55,103,43,119,63,72,128,99,83,124,216,122,117,131,125,81,188,127,143,93,120,108,195,121,168,124,74,104,160,201,89,111,126,104,122,101,133,142,131,120,103,84,92,157,130,148,149,135,206,168,166,110,150],[191,156,133,98,209,103,140,155,162,119,161,143,97,91,77,85,176,79,118,56,117,113,97,91,146,208,246,90,202,159,135,148,90,161,121,103,113,80,110,118,141,157,193,107,135,157,53,102,86,110,115,125,157,46,121,159,54,91,136,133,158,143,37,86,70,133,44,138,16,107,130,202],[143,131,251,114,206,159,184,145,141,121,100,189,165,153,123,180,118,125,163,70,31,171,55,139,185,131,122,14,129,144,164,160,143,161,82,75,116,169,115,255,121,122,89,102,173,115,110,194,140,122,217,139,98,97,139,105,206,134,130,20,135,203,42,183,126,73,57,137,120,136,61,125],[114,103,130,85,145,162,121,144,128,99,209,104,138,118,132,94,82,94,115,58,187,116,113,236,230,164,144,218,58,160,192,137,255,108,111,141,175,131,102,121,159,112,87,63,28,122,70,141,122,147,172,106,173,78,93,111,17,74,151,150,212,180,64,70,66,148,216,163,82,81,153,146],[92,21,161,95,168,63,154,119,163,152,180,120,97,181,134,117,133,102,74,108,152,144,44,132,98,100,204,136,121,161,160,149,113,116,202,66,75,115,131,165,83,106,88,94,64,122,144,96,144,151,116,103,228,91,197,182,62,160,156,90,140,138,185,172,124,183,112,116,148,134,97,71],[17,205,136,61,249,60,95,87,150,43,133,0,156,86,206,65,114,162,155,26,62,161,147,114,132,149,127,168,138,156,191,159,186,118,147,138,89,149,133,137,75,123,170,122,89,122,77,79,175,92,163,95,122,117,149,167,189,110,166,107,59,69,154,127,86,148,94,158,134,190,67,122],[6,210,131,167,195,111,157,106,176,232,164,62,138,101,167,149,112,65,7,61,78,160,125,126,164,110,165,172,156,146,150,137,166,86,78,145,81,153,117,235,124,131,86,60,132,150,104,175,115,121,197,125,137,90,160,186,145,101,137,115,64,131,125,153,72,93,153,100,72,203,67,166],[101,78,66,47,219,92,166,148,132,132,195,142,107,191,146,60,227,166,84,106,114,122,150,38,136,118,23,77,151,131,187,114,184,120,106,63,125,108,178,174,128,106,124,106,117,130,129,147,91,108,174,103,161,69,130,52,171,112,106,121,249,184,1,109,166,144,165,40,60,70,110,98],[184,147,94,109,99,128,169,128,166,175,104,62,48,160,195,97,64,109,130,66,123,82,131,66,157,249,74,123,173,69,72,109,129,188,84,98,148,135,135,186,141,124,214,68,123,116,121,166,167,212,92,88,125,186,181,98,96,88,66,108,96,70,124,85,150,195,154,130,76,145,111,134],[88,209,187,115,222,167,50,102,239,110,125,149,139,144,179,86,189,182,134,69,89,145,62,105,156,132,149,167,67,107,149,169,178,136,172,88,107,139,144,155,80,152,131,109,101,61,130,178,108,171,79,121,112,123,175,166,118,184,108,194,140,161,49,81,38,175,58,144,57,137,71,132],[62,244,189,81,191,100,6,41,219,141,124,147,81,117,156,89,181,119,115,60,140,121,121,81,117,195,109,155,159,176,146,130,132,119,159,68,191,147,148,143,49,165,94,123,65,103,121,121,88,175,65,105,80,113,135,155,196,143,116,201,162,141,26,86,89,134,62,186,58,204,96,61],[103,70,117,83,169,95,181,169,114,176,160,149,53,151,166,73,112,67,61,82,67,214,100,129,162,141,114,237,123,165,209,211,181,211,94,119,168,218,130,183,118,130,166,105,195,138,107,63,94,117,147,121,72,110,113,79,188,154,144,32,136,162,121,104,86,125,151,103,115,76,144,111],[68,179,129,67,147,170,163,123,105,145,197,85,169,132,102,39,176,34,119,62,128,160,64,184,136,119,41,31,114,83,149,223,76,101,64,121,98,75,150,95,164,96,54,79,147,156,173,176,159,100,109,35,108,163,128,114,219,126,166,17,163,183,58,191,80,196,113,173,79,82,158,88],[66,46,48,53,215,178,126,131,159,103,104,190,84,101,125,128,30,103,177,90,116,91,140,66,213,140,115,151,147,83,216,152,169,98,92,153,86,127,133,126,141,169,90,119,72,144,133,135,158,169,99,179,167,192,166,92,99,69,130,113,180,120,116,128,46,81,102,71,113,132,162,125],[126,163,122,86,146,117,78,255,135,146,140,142,168,168,105,112,107,93,94,103,136,64,138,130,116,149,153,13,176,72,187,125,173,136,61,132,106,218,72,150,108,196,128,76,58,192,75,93,72,98,193,89,94,116,109,132,101,138,48,196,169,37,112,151,50,134,147,173,66,175,119,124],[222,110,111,158,168,58,198,111,152,163,123,96,91,106,61,127,149,140,121,123,157,88,138,109,145,156,25,97,139,96,170,197,170,80,111,57,178,225,114,168,213,215,90,255,67,141,105,129,167,69,110,98,106,198,152,102,159,147,165,135,203,86,151,105,87,153,129,68,80,44,56,85],[129,55,106,141,139,173,16,115,157,102,190,50,124,140,84,203,191,71,164,133,57,122,171,85,106,131,136,130,142,30,125,134,134,147,103,138,103,195,124,140,120,122,149,99,97,113,116,133,119,104,108,141,99,112,142,104,92,130,101,66,167,98,118,142,80,177,71,98,118,109,140,95],[142,35,109,161,119,190,25,120,136,127,206,30,123,125,152,154,166,77,144,113,78,126,128,121,132,115,146,159,140,93,134,142,127,120,82,146,141,156,141,155,92,121,160,93,146,142,124,144,72,81,181,135,139,111,149,142,109,132,85,88,140,119,58,111,97,81,127,170,93,114,125,103],[74,144,97,86,199,190,178,131,169,149,215,77,244,0,238,123,125,126,147,91,139,45,82,130,86,172,108,166,220,103,118,160,177,60,118,94,94,221,115,182,114,111,143,100,91,174,158,162,132,124,176,164,139,89,49,133,128,136,188,176,69,149,152,121,118,146,113,141,92,90,137,103],[118,202,136,44,154,147,144,127,156,168,99,116,115,111,133,225,171,188,131,51,191,114,87,0,113,141,103,120,80,129,158,177,186,164,113,179,161,148,171,66,66,143,138,85,108,224,161,189,86,71,159,98,165,93,161,138,100,63,145,152,137,103,97,136,92,60,39,117,148,105,144,109],[204,174,127,82,205,153,110,91,114,158,163,114,105,144,148,154,180,127,100,49,101,135,128,192,160,52,13,107,160,189,208,224,137,122,65,205,111,199,152,195,82,136,185,104,92,126,145,189,121,73,77,131,161,141,59,124,13,128,108,190,152,104,119,161,103,186,111,133,106,178,113,0],[87,191,101,94,118,63,83,105,136,103,193,187,152,58,198,65,132,149,104,176,129,120,123,63,126,83,217,99,56,242,208,143,169,111,102,30,121,221,156,190,119,213,124,113,163,156,255,97,187,69,72,137,91,110,174,93,124,100,123,87,160,101,43,138,102,154,145,144,96,174,115,133],[189,169,22,113,176,68,176,24,148,109,126,123,99,183,174,145,74,74,93,104,142,90,120,143,83,171,130,85,156,85,137,175,158,153,98,153,112,71,63,129,85,74,133,83,111,96,109,109,0,85,161,19,115,143,116,94,130,115,155,133,202,115,123,143,130,208,48,158,144,190,95,142],[81,98,250,111,190,108,177,114,132,75,121,132,177,142,35,142,90,162,122,26,115,175,48,76,116,131,102,90,62,108,136,146,198,186,172,150,75,118,133,150,96,86,152,113,108,170,169,122,65,114,54,143,79,129,110,119,184,126,80,64,139,106,96,99,49,160,64,130,185,138,122,136],[102,224,117,117,121,121,146,99,170,85,216,106,192,88,164,109,140,113,116,166,145,168,109,138,137,197,55,134,166,124,149,152,229,16,174,95,150,115,107,131,135,169,127,158,123,107,184,215,195,102,99,126,142,146,56,38,90,121,194,93,192,66,104,100,70,135,113,237,155,108,168,87],[200,103,94,187,142,122,74,91,95,143,130,90,155,116,156,131,122,169,158,123,99,163,61,93,144,165,69,139,169,168,194,155,0,204,149,124,202,102,102,105,143,134,72,168,117,151,103,111,153,151,181,86,113,136,105,124,88,88,122,163,119,173,99,125,126,115,244,134,117,155,94,54],[190,182,104,95,224,72,132,164,202,148,155,147,79,99,36,123,167,64,141,138,146,120,101,94,152,228,229,137,160,120,114,172,89,54,107,154,201,53,152,156,133,146,118,71,130,127,163,116,111,90,111,158,129,60,52,206,177,92,162,90,139,93,86,129,50,102,84,35,126,70,135,203],[133,52,115,167,168,108,42,117,102,115,169,89,144,136,148,182,176,119,201,133,88,76,165,65,140,147,126,110,81,73,165,117,159,182,60,135,120,255,146,121,141,121,141,111,87,86,86,168,100,117,162,114,94,24,96,154,81,111,128,82,148,47,19,89,134,125,24,72,69,157,88,194],[136,222,108,107,132,119,123,68,132,91,174,183,164,159,89,125,89,134,148,105,223,161,92,92,139,113,174,218,218,70,144,142,142,81,67,180,99,161,153,217,109,112,140,175,166,147,88,153,73,162,165,81,110,134,80,121,142,211,119,147,135,61,32,171,179,135,231,188,101,255,149,118],[68,121,182,70,233,78,136,109,204,120,159,74,205,122,40,197,37,85,186,78,149,99,84,62,150,137,95,103,118,132,125,101,179,189,153,105,121,226,168,135,157,83,118,74,127,94,73,199,171,39,87,123,108,77,138,113,92,144,136,172,59,133,152,115,151,161,124,109,67,115,211,110],[70,186,169,61,159,143,86,111,191,146,184,82,144,148,159,86,121,66,166,153,116,98,6,171,161,177,47,180,41,180,103,255,139,71,85,10,65,188,106,129,132,109,108,106,246,189,125,70,114,141,227,62,146,154,114,178,99,39,125,158,66,153,69,133,96,157,161,160,61,45,89,117],[123,54,204,85,162,117,160,121,190,105,123,108,111,160,84,163,78,173,93,61,105,130,215,125,143,227,157,122,133,178,64,123,233,210,163,121,80,119,150,200,131,65,151,154,112,175,156,182,164,107,125,162,166,21,141,214,226,144,91,175,111,84,110,148,121,134,214,105,65,130,151,21],[89,104,26,93,168,186,147,110,170,194,88,190,81,159,131,88,43,28,149,46,118,83,162,153,133,166,120,122,171,129,139,183,172,208,71,123,186,122,116,123,182,154,141,143,114,166,147,147,68,129,199,151,0,86,43,134,70,145,140,72,93,158,141,151,54,152,56,153,92,93,129,44],[45,179,244,100,194,32,79,79,173,171,144,98,120,229,130,182,103,78,138,121,142,33,52,101,107,174,0,167,200,169,204,99,119,108,133,99,140,120,112,176,167,76,83,58,75,132,82,56,169,139,149,113,151,132,76,77,189,144,141,77,146,153,78,141,150,124,49,164,93,66,112,111],[141,105,180,108,127,141,175,146,172,114,106,158,117,147,91,145,89,140,192,8,41,126,53,206,153,229,176,62,159,66,145,172,182,161,111,86,126,179,110,180,181,121,112,140,128,136,147,125,81,99,96,174,154,91,89,124,58,189,68,132,109,185,105,127,195,140,15,125,154,154,97,54],[238,122,98,136,208,115,102,0,148,131,102,109,127,93,107,139,119,53,105,117,118,55,152,160,189,82,189,23,158,183,161,216,203,88,179,102,149,133,150,121,149,165,160,96,157,113,86,78,125,126,236,133,131,155,88,128,132,81,152,90,167,81,153,113,104,113,85,100,93,167,107,85],[90,168,138,62,151,190,106,119,131,138,167,55,128,94,72,119,119,139,150,89,148,111,165,137,174,128,151,106,184,108,71,156,90,49,180,134,137,79,142,134,142,83,69,100,172,143,131,54,117,143,184,42,51,32,188,99,88,154,127,115,130,148,133,5,162,183,213,50,160,107,62,101],[38,234,63,196,137,51,190,106,103,169,190,132,116,130,121,136,123,106,122,109,113,135,161,187,172,104,152,64,114,34,172,149,115,104,99,64,89,106,209,139,160,137,80,105,105,141,202,115,185,147,79,128,150,39,95,109,113,179,30,162,142,186,77,108,140,121,96,213,101,181,201,26],[88,140,154,54,176,208,126,145,167,102,226,64,86,113,42,56,166,65,118,102,184,111,84,102,153,135,113,123,168,68,97,216,162,115,97,77,47,134,100,122,107,104,96,106,151,194,158,155,138,132,163,103,96,174,88,110,147,131,147,160,90,102,121,131,169,108,159,73,70,173,118,69],[34,218,104,96,134,60,120,80,238,83,119,105,159,146,201,157,208,143,156,0,125,86,146,193,120,158,100,158,138,171,148,115,168,146,98,127,141,105,139,156,95,144,160,139,138,147,54,192,120,93,255,167,124,114,63,130,164,112,142,119,162,127,89,144,122,162,115,54,65,199,43,66],[100,96,87,27,218,139,137,133,157,117,145,116,98,178,60,78,174,123,154,122,169,137,72,114,162,167,50,65,124,162,140,133,180,191,151,138,166,182,127,137,149,140,178,106,147,133,132,82,113,255,135,249,130,103,107,131,167,127,126,112,199,116,131,84,17,107,103,145,146,166,84,145],[56,211,109,115,184,59,175,53,135,140,205,177,93,158,159,164,157,114,89,43,72,163,236,120,131,136,159,82,213,66,165,117,139,7,130,131,117,200,97,56,100,116,134,122,75,153,91,134,136,143,27,91,178,85,90,24,139,162,172,175,113,106,79,142,119,111,104,112,80,162,95,77],[73,136,156,33,154,141,73,79,141,120,141,132,193,117,137,37,181,110,114,58,66,54,125,150,123,96,181,86,122,107,47,135,197,102,72,210,138,141,79,53,255,72,69,46,25,130,121,179,152,153,137,132,180,119,114,102,202,115,176,112,115,146,114,180,98,118,97,161,129,171,116,107],[130,185,92,97,159,128,182,115,147,79,199,117,158,173,62,148,77,135,105,52,129,98,123,130,130,128,222,223,139,110,177,195,141,113,137,62,213,130,98,41,100,94,106,72,114,114,156,159,72,138,111,131,140,135,144,0,183,161,157,89,182,71,158,119,37,104,35,77,165,167,149,132],[104,61,222,68,168,72,186,115,193,97,177,97,179,179,96,87,159,99,158,49,80,138,180,101,98,143,120,120,214,156,80,150,171,125,73,122,161,120,143,122,116,115,120,85,144,197,169,140,108,76,95,132,135,111,83,149,128,191,77,97,77,23,47,114,42,122,167,86,150,118,121,167],[78,89,213,76,158,52,169,115,131,138,12,182,179,133,43,225,78,50,177,131,62,87,128,113,144,75,55,113,180,172,94,123,86,123,86,55,163,218,144,185,72,81,163,88,89,103,160,139,96,136,141,121,95,49,100,92,130,108,184,112,160,165,127,146,87,135,114,107,109,151,101,118],[103,53,169,148,113,1,126,169,117,166,200,189,127,54,170,87,151,134,112,81,80,122,167,63,98,116,165,199,130,138,171,112,232,194,165,83,125,193,114,128,160,124,130,134,123,123,155,178,106,151,103,76,113,127,58,113,123,129,148,152,118,60,77,121,72,215,162,23,66,109,100,89],[74,40,159,63,240,145,125,86,206,66,120,120,122,135,105,171,40,68,172,79,130,109,139,156,148,172,122,142,119,108,121,131,110,56,109,118,120,131,156,138,66,197,97,173,155,134,121,144,95,139,92,144,181,107,160,177,100,133,125,147,135,62,109,139,53,76,164,110,163,124,181,138],[145,116,118,60,168,129,138,158,151,118,131,130,104,69,73,79,197,84,87,121,139,146,104,119,117,193,232,41,134,118,212,140,157,111,114,175,88,98,103,121,174,97,148,81,78,193,0,138,121,138,129,190,150,141,58,77,12,82,129,124,87,140,105,149,79,174,136,94,51,111,131,69],[126,50,217,106,152,96,165,134,155,119,167,122,117,250,74,82,180,112,116,70,114,75,179,94,163,188,69,91,160,90,142,161,148,83,208,90,71,146,144,178,89,208,92,120,108,132,93,147,121,62,146,98,155,73,76,125,43,118,124,67,169,146,9,77,60,185,123,173,95,147,95,93],[49,226,177,83,163,114,113,93,225,135,108,65,119,120,177,86,77,117,181,158,99,83,105,74,148,79,96,57,95,186,190,82,129,163,140,177,120,174,98,145,114,116,114,99,192,89,160,101,90,118,24,144,160,48,114,36,156,141,77,78,98,101,55,223,32,126,118,54,218,132,122,158],[42,242,131,130,164,65,101,98,184,157,157,45,114,144,54,162,108,50,108,102,142,113,124,85,137,179,91,183,210,106,217,191,200,199,104,92,134,72,118,129,146,135,131,138,145,112,95,32,134,150,133,140,143,158,99,161,86,64,118,127,122,73,55,191,101,176,115,12,65,143,140,177],[179,143,174,114,180,127,139,91,162,107,159,72,138,107,174,178,152,94,134,140,137,111,114,79,196,185,202,23,188,188,146,207,172,148,64,142,76,133,60,158,86,104,115,57,47,130,131,128,139,225,99,105,55,126,123,146,130,170,106,129,151,96,111,136,153,188,124,209,95,135,136,193],[71,174,63,142,174,72,195,115,168,165,147,171,182,67,92,117,179,77,187,19,142,147,145,30,129,77,55,58,60,81,135,123,196,122,180,156,156,73,114,148,104,159,173,100,109,101,101,85,92,88,204,116,151,202,152,96,64,158,87,53,47,73,111,116,165,156,173,105,75,129,130,107],[83,198,63,141,136,123,211,83,121,101,227,230,214,186,83,86,145,80,160,73,94,114,179,48,114,156,98,114,76,125,132,127,64,94,155,184,122,137,70,179,67,138,145,133,153,104,88,121,116,152,135,171,163,145,166,130,93,160,78,137,129,82,172,126,109,164,88,130,146,109,136,116],[103,161,157,78,157,165,20,132,189,93,139,217,158,166,181,101,67,138,116,105,120,154,229,120,136,51,149,151,121,122,148,146,90,109,124,127,33,128,113,111,198,225,177,71,123,148,140,170,80,82,175,7,145,182,138,131,201,152,91,111,145,142,197,147,85,119,151,91,85,26,116,158],[86,140,98,135,155,157,113,88,185,178,143,97,67,121,96,166,63,255,140,95,135,102,52,135,248,162,170,128,151,92,132,120,177,65,103,159,101,254,127,100,125,134,143,65,255,89,103,105,132,116,109,100,66,85,159,254,119,143,104,78,132,120,109,156,124,203,72,123,160,81,129,125],[112,107,223,105,187,137,151,82,175,120,164,93,110,255,91,128,164,176,124,190,173,0,114,132,182,175,35,144,141,92,212,141,142,147,203,132,114,141,90,127,171,145,122,64,15,131,121,148,123,121,123,142,134,102,83,120,179,75,107,90,99,127,114,102,152,141,45,203,129,96,131,148],[111,193,90,65,137,162,183,141,137,75,182,46,147,167,36,178,96,82,74,63,129,25,128,164,132,90,236,255,113,160,158,184,166,119,119,108,191,135,98,90,107,164,134,125,97,184,85,119,235,141,68,95,103,181,140,70,160,176,123,88,153,178,83,151,43,85,71,147,161,142,132,121],[86,146,157,20,148,183,83,98,151,140,186,111,108,134,43,115,167,170,89,124,201,78,94,135,160,85,169,135,208,58,157,138,101,122,119,182,95,168,113,152,103,163,88,100,193,126,132,143,100,160,103,95,97,77,168,203,142,154,128,138,127,122,93,131,113,223,114,68,125,145,107,81],[218,169,79,112,173,83,138,49,161,123,140,59,129,140,121,106,83,73,146,54,116,25,150,153,126,60,174,162,98,0,165,163,150,167,124,88,124,168,141,165,134,123,83,52,132,201,81,158,112,231,67,68,116,82,111,195,187,82,141,74,163,60,122,46,118,157,203,67,118,146,84,226],[185,150,132,89,198,113,116,88,147,173,165,97,110,85,78,135,140,136,120,70,138,104,172,194,155,78,95,137,153,178,135,139,133,149,86,138,111,203,146,108,76,161,141,76,78,139,144,145,231,115,107,202,200,179,99,70,28,152,73,100,184,90,106,185,122,152,83,206,59,61,84,116],[138,187,173,66,152,127,159,80,137,144,191,63,83,162,134,134,76,171,121,62,148,109,98,68,174,81,168,98,107,127,130,78,150,113,25,146,226,115,149,75,74,197,141,143,166,176,163,140,137,176,147,162,182,79,23,102,2,199,117,111,83,177,140,113,99,253,60,103,112,101,130,141],[126,97,234,73,201,124,155,106,139,78,51,162,202,99,82,242,52,97,193,112,51,96,154,134,171,92,45,92,164,127,144,110,79,163,61,100,152,171,91,228,154,135,136,80,178,102,76,156,123,150,175,155,134,24,89,124,147,137,166,128,179,110,107,127,133,79,114,125,128,100,132,91],[128,86,159,64,199,102,110,120,126,102,173,147,145,147,111,188,80,157,48,79,21,136,208,126,123,183,138,23,148,132,247,107,197,172,176,121,63,180,145,243,155,68,89,110,167,231,170,123,116,48,126,133,104,143,58,103,79,174,160,96,65,174,128,126,151,181,108,74,125,150,87,169],[198,174,31,131,123,103,200,36,209,88,122,109,113,175,163,139,36,72,110,66,122,83,104,41,68,135,159,118,109,37,151,148,181,155,86,120,140,73,131,125,115,115,162,77,131,112,128,97,56,109,137,92,108,36,102,75,136,94,164,95,132,178,176,159,136,137,128,183,84,138,73,118],[75,60,108,38,242,78,173,144,124,51,128,20,154,126,201,79,131,166,142,66,124,137,144,126,108,143,75,182,202,163,110,150,147,205,117,73,187,163,124,164,137,113,142,89,138,96,90,117,136,100,81,82,175,72,117,167,165,128,102,122,150,41,190,148,173,152,110,116,131,86,196,99],[115,187,102,103,205,117,195,71,85,151,212,228,80,219,92,119,141,118,89,69,87,147,162,73,143,186,176,111,230,176,136,180,172,83,71,203,170,221,114,76,110,36,183,161,188,123,138,184,139,202,113,172,74,56,116,161,157,207,167,159,52,178,114,146,40,203,81,63,103,78,119,119],[126,186,140,72,135,113,108,87,105,142,146,158,157,144,98,178,94,199,115,81,185,137,92,140,135,98,184,137,192,108,160,177,146,170,88,137,110,162,103,162,151,135,169,122,106,186,105,133,61,199,126,34,84,158,63,23,64,246,136,100,137,104,34,196,73,163,199,240,126,228,227,171],[70,110,170,149,183,97,191,141,52,88,101,117,61,56,77,154,3,145,161,78,159,122,106,156,121,58,234,94,161,139,79,169,114,150,107,112,150,74,174,94,138,119,124,81,102,119,176,129,98,120,136,164,94,100,132,119,92,78,27,68,130,148,93,68,103,222,84,121,63,113,72,107],[103,125,68,93,68,46,124,133,206,112,155,73,137,111,158,116,176,169,161,62,131,50,182,107,163,58,153,118,120,144,139,186,138,231,161,132,56,56,0,169,106,132,161,121,197,109,182,112,187,74,99,101,165,128,14,128,102,147,86,65,128,136,57,69,164,121,86,117,108,161,140,56],[248,176,109,143,188,118,167,126,184,125,138,144,82,118,111,138,189,98,148,60,102,144,140,108,128,149,199,142,180,210,169,208,199,40,105,161,113,225,114,136,165,161,114,122,189,75,115,110,80,83,91,171,129,32,155,75,99,52,87,116,159,165,231,179,177,125,157,94,98,149,140,112],[157,155,123,88,204,106,118,100,136,159,146,93,100,137,112,107,122,147,95,66,117,114,180,189,115,126,66,123,118,76,88,141,141,142,97,143,104,171,117,141,9,174,121,30,79,150,152,177,218,144,14,188,212,193,93,82,11,111,127,156,128,62,64,218,105,160,151,114,141,106,84,54],[122,188,160,96,157,195,158,118,150,132,137,167,126,158,197,71,217,0,148,65,91,99,186,187,168,108,162,155,123,158,156,51,153,116,103,65,197,161,131,140,120,155,108,90,143,171,120,138,149,145,164,84,69,52,85,204,166,124,27,156,140,63,221,210,8,138,167,120,172,62,124,94],[146,109,102,200,159,180,76,90,162,113,130,109,120,144,132,181,166,145,138,101,76,152,145,41,110,129,96,133,168,92,127,166,56,132,164,93,180,191,125,85,122,74,97,128,128,130,97,126,198,112,105,121,90,47,124,101,33,131,125,86,149,81,144,129,83,174,180,98,130,125,84,106],[146,132,130,65,146,106,124,175,193,127,105,145,85,45,94,61,190,84,79,148,129,123,127,118,115,214,235,86,107,69,190,143,131,95,100,193,74,110,117,181,175,108,141,88,78,172,50,192,157,142,156,159,112,107,96,78,48,102,134,157,81,100,106,122,141,141,98,129,126,140,143,56],[66,112,42,101,228,88,184,185,77,58,120,52,84,96,150,82,140,110,154,64,118,87,171,36,164,89,88,117,239,95,96,165,145,139,149,91,116,146,129,105,202,118,62,117,104,131,93,197,107,85,82,103,189,80,39,175,152,158,133,161,135,121,53,159,153,118,147,88,133,91,115,51],[193,180,89,125,154,144,206,125,203,59,143,173,141,195,106,202,145,120,114,102,118,155,54,142,116,116,181,172,230,148,175,143,186,88,131,128,155,147,72,108,163,101,103,127,121,108,120,124,174,126,92,113,107,154,161,158,147,148,109,121,42,125,84,126,96,27,75,188,60,115,77,102],[26,158,105,213,194,109,184,100,105,167,108,78,87,164,118,180,131,126,47,58,82,153,103,153,159,124,152,80,153,93,130,153,148,111,119,130,141,149,195,117,193,183,34,102,111,167,74,180,86,195,205,143,122,61,154,92,222,165,72,125,141,137,113,187,49,155,71,71,50,204,147,88],[114,125,90,110,34,87,134,168,175,188,164,156,164,114,106,107,137,59,104,21,129,145,164,87,204,116,84,196,143,160,189,233,158,165,112,97,133,165,118,144,141,138,130,105,74,43,97,136,107,87,82,174,137,62,36,130,216,208,173,60,138,69,47,135,98,175,89,138,94,73,137,89],[119,180,119,90,134,88,152,123,96,164,176,198,131,166,105,182,49,192,77,118,138,88,181,77,151,91,61,121,198,98,240,193,165,143,65,111,135,152,163,92,74,63,158,131,108,65,53,166,92,60,133,152,157,58,145,222,176,150,110,124,85,49,76,119,66,125,124,209,152,76,156,133],[105,134,145,38,161,151,144,116,155,169,61,128,153,120,87,56,171,120,111,200,80,103,171,187,172,111,96,122,148,118,129,202,177,119,158,170,138,145,94,29,86,106,153,157,113,87,182,86,144,129,114,125,168,21,216,111,72,164,86,144,112,98,94,101,66,107,134,94,33,155,142,182],[116,94,89,34,220,147,128,157,148,98,133,81,107,152,96,116,143,89,127,109,115,142,98,67,192,124,104,66,152,135,185,158,192,158,141,108,180,194,129,104,135,141,129,114,207,160,98,177,86,194,75,166,166,132,65,138,77,39,116,171,174,128,110,120,136,131,105,114,126,174,144,187],[81,71,32,28,238,120,140,112,167,205,199,97,175,113,205,134,88,129,69,105,121,85,157,112,94,100,151,113,215,196,113,96,127,132,102,77,161,119,69,169,112,119,122,133,167,155,130,134,155,116,120,121,70,56,87,145,108,130,63,132,79,108,159,128,116,129,111,83,45,146,72,79],[87,188,141,64,128,113,67,72,182,87,177,164,75,134,131,120,118,86,104,128,116,131,127,51,111,154,109,55,183,172,148,175,156,147,147,96,114,224,83,154,116,194,131,85,143,163,94,255,70,145,83,145,101,125,130,23,150,63,173,87,76,154,242,115,82,97,183,86,45,111,126,80],[91,95,35,80,133,128,122,122,206,152,151,145,150,181,128,173,172,118,172,142,213,85,51,144,175,117,80,55,123,136,104,170,86,106,106,117,164,108,153,153,138,100,147,78,209,169,187,93,56,151,0,167,101,174,125,91,147,147,103,165,83,122,79,205,21,142,192,142,89,84,113,154],[116,172,119,56,118,179,102,90,0,167,115,118,152,189,75,189,156,115,178,48,200,168,119,151,101,133,220,119,138,143,112,146,160,37,147,51,165,92,143,252,154,220,131,88,124,102,142,106,157,109,114,137,178,106,110,108,106,95,131,145,204,122,98,120,90,192,159,173,75,75,181,133],[182,205,123,123,180,143,129,142,195,140,149,163,113,123,127,135,154,182,254,58,87,148,127,136,144,180,130,241,132,79,124,180,124,176,147,84,116,116,146,84,71,117,127,84,135,182,107,196,104,206,145,123,48,61,121,104,88,140,123,84,94,58,100,166,80,122,168,108,89,138,118,81],[168,131,193,125,185,177,190,112,167,130,194,160,141,159,223,121,187,117,194,165,172,36,196,94,185,118,116,126,209,85,195,219,184,165,132,165,242,106,86,145,174,181,23,112,64,104,134,139,122,54,110,116,166,168,111,86,153,87,96,107,167,121,116,166,170,125,119,138,127,149,114,190],[76,139,119,255,197,163,227,114,107,148,77,57,78,120,169,89,102,220,163,130,132,53,135,127,111,132,218,91,188,127,184,202,136,181,115,166,156,174,98,97,125,173,50,71,127,166,133,147,60,82,160,123,127,84,148,70,229,143,131,138,159,98,83,186,155,169,106,114,73,112,143,150],[107,63,56,64,250,148,112,102,189,76,138,162,143,75,158,188,59,160,144,46,172,89,173,163,150,196,127,94,121,95,226,114,163,75,69,123,133,98,98,91,155,113,101,110,117,133,148,226,145,107,178,100,203,129,160,91,138,114,108,105,59,156,125,150,174,166,86,118,68,129,176,51],[152,174,102,183,147,100,100,56,79,166,72,48,162,110,105,160,177,129,10,63,142,125,137,121,195,155,12,119,180,162,176,216,167,113,165,131,104,47,82,114,124,158,144,155,105,39,121,105,121,95,184,130,148,151,121,158,141,150,54,177,0,127,84,127,88,69,102,151,177,127,100,113],[77,94,34,76,188,132,86,111,153,121,154,162,124,134,118,120,0,122,166,137,74,105,172,47,185,127,87,141,134,81,173,146,197,121,21,117,34,21,159,186,202,169,94,146,94,100,175,151,126,139,80,148,195,81,94,145,100,127,125,144,124,112,77,218,85,111,115,138,121,88,134,165],[60,191,119,132,162,177,189,97,158,160,180,75,69,126,85,122,114,199,49,87,97,158,118,161,163,88,178,123,157,95,105,122,93,134,129,145,102,145,57,133,118,105,154,90,67,68,121,170,133,105,150,152,159,108,59,213,112,66,92,40,246,93,54,114,76,121,158,105,56,108,112,146],[85,208,98,158,170,88,155,62,195,166,145,74,176,157,5,20,70,116,170,162,110,184,130,161,80,70,150,41,177,130,211,111,157,157,109,112,101,191,91,123,190,143,133,65,63,115,93,141,115,115,244,117,212,108,99,243,18,207,147,96,213,209,129,94,61,184,187,136,102,52,127,169],[135,129,224,76,214,142,217,129,149,100,150,148,159,205,157,159,71,60,173,73,139,119,146,68,151,88,162,61,154,141,95,177,122,212,73,179,182,150,121,143,177,134,70,135,87,124,139,122,130,132,145,203,159,179,82,203,85,110,52,144,153,86,116,78,114,149,214,100,45,101,64,95],[96,45,147,80,198,152,115,126,190,84,118,165,158,149,130,109,26,177,134,32,102,164,156,207,138,151,196,98,112,92,255,170,129,94,119,163,64,133,139,119,91,144,168,93,190,182,96,148,115,182,112,116,137,146,50,139,50,139,118,134,103,124,113,120,29,118,74,203,122,93,103,155],[98,121,57,66,118,102,108,94,169,106,80,189,153,71,93,119,194,139,106,181,73,86,157,88,151,108,196,46,134,131,166,172,120,127,130,202,161,141,125,122,93,136,122,143,83,127,158,131,175,156,146,140,105,95,106,116,132,61,69,139,78,64,105,156,108,177,189,200,169,59,71,146],[86,94,35,17,224,124,152,102,185,148,146,78,97,231,164,91,131,180,148,67,129,146,58,114,174,126,210,88,106,173,108,173,144,106,129,99,69,185,101,105,142,104,109,111,92,122,61,145,166,102,161,125,221,122,94,137,154,62,97,133,75,56,83,169,171,147,144,175,194,147,109,112],[82,189,66,98,132,97,134,103,204,105,89,141,122,165,133,223,110,173,47,129,64,132,82,169,140,74,170,155,194,102,77,156,193,249,140,86,140,70,141,128,144,207,56,180,146,128,161,152,182,117,114,141,72,135,55,187,125,70,44,188,113,31,120,128,156,172,153,44,168,65,205,187],[146,133,120,129,160,200,166,73,104,114,147,157,190,220,98,0,110,129,47,104,107,66,72,156,189,141,102,94,170,169,215,80,71,170,122,157,172,152,220,109,83,139,138,96,52,134,133,106,124,125,180,130,109,211,88,174,166,48,129,121,8,127,65,126,111,123,175,52,119,89,134,29],[113,179,126,26,132,137,151,84,84,157,125,114,189,139,46,45,74,120,34,255,107,115,113,145,158,121,104,186,133,83,117,158,126,100,71,99,163,152,134,146,71,166,191,197,136,84,122,202,52,152,143,160,104,185,100,97,144,126,173,109,141,98,64,131,255,134,193,161,105,116,113,161],[117,199,159,184,203,185,27,194,145,130,75,169,153,190,227,105,79,124,118,117,125,107,125,81,111,88,100,131,147,60,143,179,104,78,203,156,192,157,129,122,185,104,132,144,115,154,129,174,240,106,85,136,152,121,61,82,198,117,71,95,142,121,138,103,57,158,231,142,167,129,53,135],[239,173,92,138,201,102,91,108,118,121,186,97,122,123,117,65,122,118,158,52,70,52,55,187,130,80,172,96,155,139,211,155,120,245,117,163,178,122,180,164,92,160,187,140,132,174,137,187,160,146,128,115,127,64,85,187,139,54,127,106,111,171,132,175,112,111,224,237,123,96,140,144],[110,228,119,103,158,147,195,60,69,173,213,194,125,181,170,200,73,110,48,102,113,40,167,115,148,150,42,167,185,121,122,161,103,166,120,146,89,110,144,126,41,75,94,100,173,150,53,233,196,127,122,230,114,106,165,145,48,102,140,135,64,58,75,30,67,210,100,207,117,124,130,148],[105,162,158,68,164,147,158,116,229,115,127,89,62,77,79,86,135,107,79,125,161,108,120,107,113,189,178,118,147,96,158,143,121,100,107,166,141,141,126,182,147,189,98,69,68,129,190,132,154,129,222,148,66,38,34,29,145,183,88,155,155,57,87,148,116,118,183,168,210,45,149,99],[48,172,137,102,186,49,194,128,126,1,79,78,114,86,228,146,82,170,134,104,101,99,127,187,168,99,187,222,204,154,157,186,96,71,103,167,102,236,159,132,85,127,194,70,176,114,135,62,138,153,123,139,82,117,82,154,119,144,121,142,122,72,134,145,69,186,118,131,113,98,114,90],[35,123,128,95,221,40,188,138,69,0,19,50,117,71,155,137,98,123,163,135,62,103,106,141,132,74,147,159,213,112,182,186,121,55,134,131,84,179,132,122,32,97,147,80,100,131,124,135,145,115,124,153,130,129,110,132,110,136,110,146,186,109,156,167,110,165,143,70,115,103,132,124],[176,144,124,105,202,115,152,108,147,104,209,155,179,148,94,109,85,86,189,99,188,112,117,129,182,226,224,117,178,154,92,182,100,223,116,141,79,151,136,99,131,124,179,82,105,172,168,139,188,182,205,67,159,144,79,160,215,105,76,102,173,90,88,246,139,145,136,30,139,138,72,72],[121,114,130,57,152,143,176,132,189,123,87,144,124,57,55,77,213,108,79,169,126,122,109,94,127,181,225,84,157,46,162,146,128,84,138,181,83,138,94,152,129,105,136,97,103,153,87,118,175,104,144,177,117,0,77,13,149,104,97,115,75,111,67,139,98,118,165,182,147,40,98,148],[164,167,85,89,154,172,206,49,213,99,149,90,65,176,106,126,111,96,104,43,114,111,200,160,0,41,107,150,143,58,106,162,220,152,169,105,94,140,162,134,130,111,129,60,159,126,124,173,114,163,96,188,129,111,150,145,120,131,161,96,98,145,24,156,80,131,190,163,149,123,113,133],[57,201,68,84,137,86,130,79,70,43,155,40,112,103,149,137,41,60,123,138,184,188,138,136,103,138,68,63,111,236,72,170,160,99,255,125,133,142,129,205,118,194,132,116,128,114,106,200,95,111,137,158,107,60,97,112,67,149,126,105,150,84,102,158,197,110,99,105,179,102,135,77],[90,198,106,71,112,159,107,132,110,71,127,45,157,43,137,75,47,130,102,83,174,100,197,178,191,145,88,225,98,161,178,126,146,124,117,170,106,140,121,70,124,128,166,150,127,122,123,72,105,189,113,173,151,1,82,69,129,139,103,127,151,89,64,109,130,106,134,38,56,161,98,103],[179,109,7,158,145,89,158,91,191,119,46,102,135,186,100,104,132,64,70,80,215,60,146,118,116,203,92,155,181,154,116,126,195,197,129,116,164,142,137,146,133,104,160,176,93,139,119,165,177,128,84,110,71,160,147,137,134,64,103,141,152,148,104,138,70,109,82,137,149,162,64,74],[135,139,110,135,156,205,150,104,186,79,164,115,82,136,70,152,175,169,104,100,129,128,110,136,141,146,101,65,173,172,195,107,129,138,117,60,182,178,151,177,190,112,164,93,82,98,120,131,90,132,135,152,97,48,117,170,129,151,135,141,86,136,89,247,101,38,125,62,141,120,130,137],[77,73,96,65,229,148,199,129,168,170,192,65,189,75,179,164,76,91,142,63,226,120,176,148,146,102,102,51,190,110,142,124,108,98,158,136,213,136,147,137,112,100,158,173,126,110,156,73,91,169,116,184,100,117,87,89,123,71,154,166,124,80,120,116,57,76,128,146,91,85,83,53],[38,212,84,195,181,181,207,116,186,164,163,49,150,90,118,125,109,200,247,166,161,173,159,136,105,178,171,111,132,152,181,133,173,210,177,101,151,175,91,148,90,142,150,137,119,142,127,146,103,119,198,171,178,160,157,111,105,165,117,112,178,105,86,142,99,198,155,130,123,120,110,134],[54,210,129,106,164,90,64,57,168,101,176,150,130,90,60,130,157,80,108,46,87,174,169,157,161,149,254,116,99,117,96,138,140,132,90,134,237,204,110,85,129,172,127,119,47,66,124,149,54,187,112,123,185,100,73,152,217,73,86,88,90,129,152,88,75,187,83,151,125,151,106,120],[80,66,119,130,92,154,134,149,132,125,82,117,49,144,190,56,57,76,166,66,167,98,39,188,102,187,132,126,147,162,181,123,167,154,84,128,82,116,103,83,130,137,152,123,136,142,103,154,127,168,64,207,137,121,104,170,126,89,26,139,207,109,78,102,174,139,135,98,90,156,78,121],[122,137,79,103,204,255,182,101,122,97,156,255,155,51,123,132,80,108,121,49,84,83,85,162,155,198,82,109,146,112,94,205,155,181,77,102,145,89,159,183,130,117,72,148,83,112,99,52,130,110,109,107,86,75,121,146,59,101,76,107,207,111,100,183,44,159,111,155,56,148,116,59],[110,117,109,206,137,224,112,88,143,176,136,137,69,115,57,190,131,168,171,117,107,122,152,184,196,184,120,104,207,136,137,202,202,20,86,80,120,198,121,168,60,118,108,112,218,166,61,104,95,149,87,122,127,154,100,100,142,158,78,124,49,123,67,121,182,169,79,81,160,101,48,116],[21,184,45,138,161,79,137,96,122,84,165,114,30,128,139,128,210,188,117,124,110,49,79,59,160,54,151,179,106,183,107,190,156,150,88,65,107,128,113,212,151,98,109,83,0,171,164,190,100,102,135,145,148,84,110,133,99,132,116,119,85,106,81,82,65,127,97,81,133,130,69,72],[160,179,130,93,187,93,131,162,156,139,145,188,120,92,136,204,137,134,138,139,157,152,198,177,124,151,115,103,112,255,171,97,189,119,109,68,0,114,123,45,171,162,85,22,108,56,113,60,80,81,129,218,20,164,77,89,158,114,133,131,117,60,112,109,138,169,223,194,136,100,78,111],[84,84,55,64,237,116,86,105,123,68,152,133,128,115,121,145,132,158,81,155,181,106,212,78,97,103,14,159,164,105,146,101,186,166,94,113,212,3,136,99,182,188,157,117,142,151,176,115,166,185,193,196,107,65,114,154,150,155,127,146,171,114,151,155,63,172,84,125,88,107,93,176],[140,171,114,87,155,173,163,78,195,89,140,81,97,189,178,179,68,139,60,94,123,118,95,114,88,141,161,89,130,38,81,97,159,158,86,63,83,136,164,63,97,165,81,103,189,72,177,105,129,70,141,81,127,116,74,59,45,123,146,87,150,81,117,207,67,130,123,155,56,79,145,146],[143,119,160,177,200,64,100,77,155,140,133,78,166,135,139,154,123,132,67,88,168,48,105,38,197,154,168,6,159,151,164,212,165,168,60,94,87,88,149,111,0,132,150,122,28,176,115,89,148,197,90,106,77,118,74,150,39,160,155,72,206,69,188,187,159,135,166,188,96,40,121,147],[214,184,84,108,225,72,124,159,158,162,159,114,82,106,100,110,101,110,147,122,157,142,140,134,149,168,141,116,174,117,114,130,140,42,117,163,198,77,175,166,145,121,98,53,198,147,143,114,129,63,30,150,174,136,90,193,89,126,148,139,214,47,100,194,49,46,66,76,148,150,134,144],[71,75,52,33,223,164,143,98,157,202,152,139,89,208,149,116,122,101,187,101,198,149,78,151,162,164,196,46,69,155,175,112,148,103,122,92,166,244,141,130,151,136,102,159,87,150,167,91,119,126,80,174,82,142,151,140,206,122,146,107,97,129,59,151,121,119,178,156,72,112,70,90],[236,178,96,107,201,94,133,58,139,142,118,102,142,154,39,96,131,136,92,25,150,89,126,166,106,25,142,157,161,139,218,207,156,66,161,152,128,202,117,110,189,79,106,161,136,105,186,161,106,138,196,171,174,106,101,122,207,88,156,204,197,64,140,96,50,196,19,99,58,60,161,163],[133,176,99,96,152,150,117,171,203,60,205,115,99,139,119,207,136,106,104,38,140,99,114,171,177,79,171,204,200,134,243,153,192,83,125,161,222,173,130,161,136,144,155,63,68,193,121,117,100,111,136,117,165,95,131,149,56,157,92,158,114,112,92,107,78,155,156,117,79,89,119,160],[5,189,143,167,131,99,162,96,106,104,89,92,0,141,166,127,67,97,138,103,155,145,59,216,157,105,140,164,160,151,164,129,110,105,97,190,108,118,115,130,69,93,122,118,53,98,134,174,84,97,81,197,69,109,93,122,130,95,104,139,231,148,115,84,125,116,132,114,76,122,111,130],[74,176,103,95,97,66,101,89,131,55,202,229,149,137,125,165,74,124,85,170,64,132,116,127,153,143,105,86,113,122,126,158,131,197,116,71,87,151,54,204,105,198,160,82,208,225,161,162,46,99,96,218,177,54,119,24,79,44,161,119,147,125,163,174,164,148,141,144,85,130,102,128],[206,131,93,149,169,58,124,50,128,130,59,83,137,124,208,100,104,58,52,137,125,73,131,69,174,240,145,51,154,211,107,142,199,187,186,136,99,108,56,123,126,89,150,110,147,139,110,229,163,149,138,170,125,125,197,130,116,113,154,111,155,212,74,118,21,183,101,194,124,139,148,147],[145,127,137,25,87,152,91,187,146,111,184,102,123,107,126,73,132,150,131,88,113,43,140,95,146,158,66,11,231,152,181,146,129,113,149,118,70,159,156,116,24,152,47,88,65,169,149,149,73,136,169,187,61,143,151,163,128,126,33,128,149,187,138,114,70,134,124,147,112,185,159,100],[83,88,40,42,215,88,190,134,136,114,148,77,129,199,190,40,150,118,197,91,158,58,99,158,120,137,122,127,189,185,130,143,102,50,172,95,75,184,143,104,105,172,180,11,116,140,67,118,199,100,205,130,60,8,71,80,144,168,48,142,186,124,156,113,54,128,129,166,6,154,93,78],[55,176,74,188,171,95,195,104,157,209,164,110,125,209,32,101,177,192,148,91,63,37,226,66,161,206,196,105,116,101,136,146,150,49,147,93,63,194,169,103,182,119,117,45,136,112,162,158,75,163,97,68,71,101,92,139,128,115,121,126,167,121,125,134,139,98,132,181,89,113,82,43],[91,87,92,56,205,49,148,170,157,59,128,92,149,141,123,75,227,131,142,43,95,154,196,114,195,96,102,101,164,66,147,150,126,121,88,74,152,100,123,137,54,153,93,117,201,93,106,127,97,208,164,77,135,152,164,60,76,113,155,102,126,95,36,156,26,202,76,181,119,169,133,141],[173,127,107,90,89,118,162,174,174,106,196,44,125,140,136,140,91,134,164,122,66,158,170,101,167,176,160,126,209,129,164,187,114,207,181,149,84,164,196,132,97,133,103,114,80,93,81,143,142,131,129,99,255,89,77,149,170,126,122,174,162,108,159,108,59,148,81,185,97,118,129,49],[92,67,73,85,251,125,114,104,179,100,104,169,117,80,94,147,52,177,154,34,117,12,142,74,133,206,117,165,118,118,211,84,229,110,93,87,121,149,107,119,135,142,153,144,205,74,184,155,154,137,104,165,97,133,87,138,109,78,91,167,199,231,143,144,174,151,48,61,158,132,176,114],[92,22,157,155,113,40,166,141,138,149,166,141,119,134,156,73,157,71,91,149,198,133,99,121,98,72,72,150,175,162,110,212,187,107,50,116,219,118,127,151,114,183,118,80,160,153,116,137,145,109,80,117,121,92,157,162,250,173,145,158,65,76,91,103,95,121,154,83,138,65,164,92],[19,106,122,175,185,144,173,113,36,62,161,97,65,80,102,117,95,73,84,65,153,144,110,175,164,152,142,95,124,92,131,157,193,146,118,169,146,118,97,102,71,92,134,105,109,100,157,109,139,84,12,167,90,138,92,157,229,112,126,168,115,119,105,106,48,155,98,97,137,151,119,114],[200,199,101,122,166,33,85,194,90,164,132,85,133,130,113,78,43,146,211,151,62,84,63,142,151,191,132,49,183,133,120,92,125,174,126,188,166,44,168,87,85,163,105,104,168,144,196,124,150,151,109,177,181,105,91,136,241,170,157,100,138,90,150,79,59,124,132,210,108,119,79,23],[143,44,103,161,147,174,0,90,105,117,189,31,147,136,144,160,162,105,144,114,48,119,145,95,150,96,116,91,108,64,127,155,147,113,118,172,125,191,109,148,88,113,124,98,139,110,116,113,101,130,163,192,102,123,120,161,59,94,125,111,137,121,69,144,81,161,0,79,91,155,144,117],[130,4,108,175,128,134,58,96,115,115,207,37,98,136,151,174,128,90,160,147,86,111,118,117,109,108,141,122,107,67,159,113,163,115,54,145,133,144,118,104,79,105,132,47,96,89,160,114,120,127,152,154,83,101,127,141,157,107,123,143,143,36,64,135,123,133,153,129,104,145,66,120],[255,184,110,116,203,68,101,163,121,151,184,83,88,139,149,49,62,131,170,101,62,43,20,140,152,115,99,68,185,140,168,123,135,105,107,168,180,161,151,204,123,170,173,150,167,137,167,141,83,118,158,81,94,102,82,145,127,131,96,114,148,83,164,82,104,172,170,175,47,140,162,107],[212,162,86,131,194,74,100,77,141,121,170,93,175,128,48,118,121,144,103,46,156,127,127,114,155,193,223,206,168,145,115,148,130,203,115,86,123,160,92,90,103,124,93,82,125,102,157,127,86,0,197,229,163,114,138,20,194,114,152,148,165,80,129,191,50,76,55,106,134,117,138,142],[76,133,144,140,156,74,237,165,83,65,121,112,116,117,125,119,53,161,116,68,122,64,59,49,141,81,149,114,214,165,151,166,70,198,138,170,129,187,140,102,120,138,139,123,57,102,128,121,139,99,103,227,95,118,170,51,95,128,148,51,17,115,123,136,63,161,168,196,82,95,96,143],[214,156,112,112,191,100,138,110,188,109,137,96,90,132,109,143,126,121,102,97,119,185,149,173,86,127,67,158,160,137,87,129,160,84,62,156,35,238,74,179,216,120,145,189,78,91,165,129,110,56,144,158,56,186,181,140,160,141,29,170,132,128,38,171,85,182,111,169,69,108,137,168],[83,110,41,92,208,126,125,138,118,100,122,194,173,142,23,187,35,141,146,136,26,128,252,40,208,138,119,132,178,47,145,138,203,150,73,128,74,121,147,156,146,176,41,98,135,107,164,206,135,87,65,72,90,61,108,138,106,92,133,157,110,135,61,95,30,141,120,162,80,146,90,34],[168,96,99,130,129,155,143,41,150,79,147,99,214,155,112,68,137,89,162,101,153,149,80,51,142,202,143,128,158,121,131,150,94,182,49,181,83,192,165,149,103,137,78,158,91,120,146,93,167,70,124,144,201,111,80,168,60,157,175,136,143,164,150,138,51,198,172,25,113,169,37,75],[174,174,62,79,150,103,177,188,186,120,104,117,159,121,101,181,78,78,184,119,139,159,81,85,174,193,168,73,172,124,133,184,153,143,213,139,175,125,185,50,115,45,122,17,125,124,113,101,96,104,165,59,182,151,113,132,180,145,92,137,141,103,125,128,183,232,72,119,48,120,0,143],[55,211,116,164,148,31,185,121,140,78,134,167,172,132,52,102,176,73,151,69,75,153,198,117,178,172,105,88,61,68,167,157,169,97,66,167,137,150,99,93,127,211,187,72,156,127,190,60,129,203,212,141,132,124,87,193,116,86,142,141,107,140,71,78,93,161,144,141,181,197,112,89],[79,167,151,115,176,138,78,242,157,104,130,112,120,164,138,92,111,136,69,70,116,66,105,136,96,141,54,43,169,161,197,155,175,96,101,157,99,221,97,120,134,157,19,119,177,84,171,95,185,118,194,178,148,68,54,53,132,134,54,157,155,40,116,140,46,169,154,133,132,181,64,164],[90,225,171,98,205,132,106,113,208,108,162,86,91,128,115,98,122,125,123,103,188,147,126,121,143,160,104,139,194,70,209,169,132,140,142,133,163,129,111,210,95,129,73,73,57,74,143,205,140,169,115,135,133,110,92,141,90,131,106,141,180,69,178,135,87,91,142,203,63,135,98,118],[231,170,125,100,156,84,166,102,203,143,148,47,75,114,154,108,71,120,5,64,149,109,173,62,178,136,26,79,77,60,75,169,110,37,50,52,166,153,79,157,84,183,131,46,52,105,122,119,119,145,36,147,88,145,73,121,172,157,76,180,122,167,188,166,97,203,115,98,140,169,113,168],[172,107,177,147,180,71,190,168,156,176,118,138,51,151,137,73,166,94,62,145,48,189,170,129,177,176,106,212,147,158,60,214,157,123,161,141,110,162,130,173,103,161,129,139,191,166,81,57,138,138,131,78,114,164,159,88,129,93,206,126,197,171,89,143,81,67,119,136,126,152,194,115],[233,226,97,114,204,46,117,167,148,146,179,111,72,93,78,111,130,130,233,141,110,77,108,156,106,147,79,134,114,80,130,139,176,127,174,162,134,146,110,158,87,173,66,108,90,91,138,154,209,146,147,162,139,30,115,143,183,